gutovsk49/MyoLab/firmware_bt/ATmega328.c.c
/* -----------------------------------------------------------------------------
 * Configures the timer1 compare outputs
 * -------------------------------------------------------------------------- */

resultValue_t timer1OutputConfig(timerOutput_t compA, timerOutput_t compB)
{
	uint8 aux8 = TCCR1A;

	if(compA != TIMER_PORT_NO_CHANGE){
		aux8 &= ~(0x03 << COM1A0);
		aux8 |= (compA << COM1A0); 
	}
	if(compB != TIMER_PORT_NO_CHANGE){
		aux8 &= ~(0x03 << COM1B0);
		aux8 |= (compB << COM1B0); 
	}
	TCCR1A = aux8;
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Configures the noise canceler of input capture of timer1
 * -------------------------------------------------------------------------- */

resultValue_t	timer1InputCaptureNoiseCancelerConfig(timerInputCaptureNoiseCanceler_t mode)
{
	uint8 aux8 = TCCR1B;

	aux8 &= ~(0x03 << ICES1);
	aux8 |= mode;

	TCCR1B = aux8;
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Activates the timer1 overflow interrupt
 * -------------------------------------------------------------------------- */

resultValue_t timer1ActivateOverflowInterrupt(void)
{
	setBit(TIMSK1, TOIE1);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Deactivates the timer1 overflow interrupt
 * -------------------------------------------------------------------------- */

resultValue_t timer1DeactivateOverflowInterrupt(void)
{
	clrBit(TIMSK1, TOIE1);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Clears the timer1 overflow interrupt request
 * -------------------------------------------------------------------------- */

resultValue_t timer1ClearOverflowInterruptRequest(void)
{
	setBit(TIFR1, TOV1);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Activates the timer1 compare A interrupt
 * -------------------------------------------------------------------------- */

resultValue_t timer1ActivateCompareAInterrupt(void)
{
	setBit(TIMSK1, OCIE1A);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Deactivates the timer1 compare A interrupt
 * -------------------------------------------------------------------------- */

resultValue_t timer1DeactivateCompareAInterrupt(void)
{
	clrBit(TIMSK1, OCIE1A);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Clears the timer1 compare A interrupt request
 * -------------------------------------------------------------------------- */

resultValue_t timer1ClearCompareAInterruptRequest(void)
{
	setBit(TIFR1, OCF1A);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Activates the timer1 compare B interrupt
 * -------------------------------------------------------------------------- */

resultValue_t timer1ActivateCompareBInterrupt(void)
{
	setBit(TIMSK1, OCIE1B);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Deactivates the timer1 compare B interrupt
 * -------------------------------------------------------------------------- */

resultValue_t timer1DeactivateCompareBInterrupt(void)
{
	clrBit(TIMSK1, OCIE1B);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Clears the timer1 compare B interrupt request
 * -------------------------------------------------------------------------- */

resultValue_t timer1ClearCompareBInterruptRequest(void)
{
	setBit(TIFR1, OCF1B);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Activates the timer1 input capture interrupt
 * -------------------------------------------------------------------------- */

resultValue_t timer1ActivateInputCaptureInterrupt(void)
{
	setBit(TIMSK1, ICIE1);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Deactivates the timer1 input capture interrupt
 * -------------------------------------------------------------------------- */

resultValue_t timer1DeactivateInputCaptureInterrupt(void)
{
	clrBit(TIMSK1, ICIE1);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Clears the timer1 input capture interrupt request
 * -------------------------------------------------------------------------- */

resultValue_t timer1ClearInputCaptureInterruptRequest(void)
{
	setBit(TIFR1, ICF1);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Forces a comparison on the output compare A of the timer1
 * -------------------------------------------------------------------------- */

resultValue_t timer1ForceCompareA(void)
{
	setBit(TCCR1C, FOC1A);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Forces a comparison on the output compare B of the timer1
 * -------------------------------------------------------------------------- */

resultValue_t timer1ForceCompareB(void)
{
	setBit(TCCR1C, FOC1B);
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Sets the timer1 counter value
 * -------------------------------------------------------------------------- */

resultValue_t timer1SetCounterValue(uint16 value)
{
	ATOMIC_BLOCK(ATOMIC_RESTORESTATE){
		TCNT1 = value;
	}
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Gets the timer1 counter value
 * -------------------------------------------------------------------------- */

uint16 timer1GetCounterValue(void)
{
	return TCNT1;
}

/* -----------------------------------------------------------------------------
 * Sets the timer1 compare A value
 * -------------------------------------------------------------------------- */

resultValue_t timer1SetCompareAValue(uint16 value)
{
	ATOMIC_BLOCK(ATOMIC_RESTORESTATE){
		OCR1A = value;
	}
	return RESULT_OK;
}

