gutovsk49/MyoLab/firmware_bt/ATmega328.c.c
/* -----------------------------------------------------------------------------
 * Sets the timer2 counter value
 * -------------------------------------------------------------------------- */

resultValue_t timer2SetCounterValue(uint8 value)
{
	TCNT2 = value;
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Gets the timer2 counter value
 * -------------------------------------------------------------------------- */

uint8 timer2GetCounterValue(void)
{
	return TCNT2;
}

/* -----------------------------------------------------------------------------
 * Sets the timer2 compare A value
 * -------------------------------------------------------------------------- */

resultValue_t timer2SetCompareAValue(uint8 value)
{
	OCR2A = value;
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Gets the timer2 compare A value
 * -------------------------------------------------------------------------- */

uint8 timer2GetCompareAValue(void)
{
	return OCR2A;
}

/* -----------------------------------------------------------------------------
 * Sets the timer2 compare B value
 * -------------------------------------------------------------------------- */

resultValue_t timer2SetCompareBValue(uint8 value)
{
	OCR2B = value;
	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Gets the timer2 compare B value
 * -------------------------------------------------------------------------- */

uint8 timer2GetCompareBValue(void)
{
	return OCR2B;
}

/* -----------------------------------------------------------------------------
 * Configures the adc module
 * -------------------------------------------------------------------------- */

resultValue_t adcConfig(adcMode_t mode, adcReference_t reference, adcPrescaler_t  prescaler)
{
	uint8 reg = 0;

	if(reference != ADC_REFERENCE_NO_CHANGE){
		reg = ADMUX;
		reg &= ~(0x03 << REFS0);
		reg |= reference << REFS0;
		ADMUX = reg;
	}

	if(prescaler != ADC_PRESCALER_NO_CHANGE){
		reg = ADCSRA;
		reg &= ~(0x07 << ADPS0);
		reg |= prescaler << ADPS0;
		ADCSRA = reg;
	}

	if(mode != ADC_MODE_NO_CHANGE){
		if(mode == ADC_MODE_SINGLE_CONVERSION)
			clrBit(ADCSRA, ADATE);
		else{
			reg = ADCSRB;
			reg &= ~(0x07 << ADTS0);
			switch(mode){
				case ADC_MODE_AUTO_ANALOG_COMP:		reg |= (1 << ADTS0);	break;
				case ADC_MODE_AUTO_INT0:			reg |= (2 << ADTS0);	break;
				case ADC_MODE_AUTO_TIMER0_COMPA:	reg |= (3 << ADTS0);	break;
				case ADC_MODE_AUTO_TIMER0_OVERFLOW:	reg |= (4 << ADTS0);	break;
				case ADC_MODE_AUTO_TIMER1_COMPB:	reg |= (5 << ADTS0);	break;
				case ADC_MODE_AUTO_TIMER1_OVERFLOW:	reg |= (6 << ADTS0);	break;
				case ADC_MODE_AUTO_TIMER1_CAPTURE:	reg |= (7 << ADTS0);	break;
				default:							return RESULT_UNSUPPORTED_VALUE;	break;
			}
			ADCSRB = reg;
			setBit(ADCSRA, ADATE);
		}
	}

	return RESULT_OK;
 }

/* -----------------------------------------------------------------------------
 * Selects the adc channel
 * -------------------------------------------------------------------------- */

resultValue_t adcSelectChannel(adcChannel_t channel)
{
	uint8 reg = ADMUX;

	reg &= ~(0x0F << MUX0);
	reg |= (channel << MUX0);
	ADMUX = reg;

	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Enable adc digital inputs
 * -------------------------------------------------------------------------- */

resultValue_t adcEnableDigitalInput(uint8 flagInputs)
{
	DIDR0 &= (~flagInputs);

	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Enable adc digital inputs
 * -------------------------------------------------------------------------- */

resultValue_t adcDisableDigitalInput(uint8 flagInputs)
{
	DIDR0 |= flagInputs;

	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Sets the adc data presentation
 * -------------------------------------------------------------------------- */

resultValue_t adcDataPresentation(adcDataPresentation_t presentation)
{
	if(presentation == ADC_LEFT_ADJUSTED)
		setBit(ADMUX, ADLAR);
	else
		clrBit(ADMUX, ADLAR);

	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Enables the adc module
 * -------------------------------------------------------------------------- */

resultValue_t adcEnable(void)
{
	setBit(ADCSRA, ADEN);

	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Disables the adc module
 * -------------------------------------------------------------------------- */

resultValue_t adcDisable(void)
{
	clrBit(ADCSRA, ADEN);

	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Clears the adc interrupt request
 * -------------------------------------------------------------------------- */

resultValue_t adcClearInterruptRequest(void)
{
	setBit(ADCSRA, ADIF);

	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Enables the adc interrupt
 * -------------------------------------------------------------------------- */

resultValue_t adcActivateInterrupt(void)
{
	setBit(ADCSRA, ADIE);

	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Disables the adc interrupt
 * -------------------------------------------------------------------------- */

resultValue_t adcDeactivateInterrupt(void)
{
	clrBit(ADCSRA, ADIE);

	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Starts an adc conversion
 * -------------------------------------------------------------------------- */

resultValue_t adcStartConversion(void)
{
	setBit(ADCSRA, ADSC);

	return RESULT_OK;
}

/* -----------------------------------------------------------------------------
 * Returns if an adc conversion is running
 * -------------------------------------------------------------------------- */

bool_t adcIsBusy(void)
{
	return isBitSet(ADCSRA, ADSC);
}

