gutovsk49/MyoLab/firmware_bt/ATmega328.c.c
/* -----------------------------------------------------------------------------
 * Verifies if there is new data in the receiver buffer. Must be called before
 * reading the buffer.
 * -------------------------------------------------------------------------- */

uint8 usartIsReceiverBufferEmpty(void)
{
	if(usartReceiverBufferLength == 0)
		return TRUE;
	return FALSE;
}

/* -----------------------------------------------------------------------------
 * Returns the current baud rate.
 * -------------------------------------------------------------------------- */

 uint32 usartGetCurrentBaudRate(void)
 {
	uint32 aux32 = 0;

//	switch(usartConfiguration.mode){
//	case 0:
//		aux32 = F_CPU / 16 / (UBRR0 + 1);
//		break;
//	case 1:
//		aux32 = F_CPU / 8 / (UBRR0 + 1);
//		break;
//	case 2:
//		aux32 = F_CPU / 2 / (UBRR0 + 1);
//		break;
//	}
	return aux32;
 }



















/* -----------------------------------------------------------------------------
 * Configures the SPI controller
 * -------------------------------------------------------------------------- */

void spiInit(void)
{
/*
	if(spiConfiguration.masterSlave){
		setBit(SPI_DDR, SPI_MOSI);
		setBit(SPI_DDR, SPI_SCK);
		clrBit(SPI_DDR, SPI_MISO);
	}else{
		clrBit(SPI_DDR, SPI_MOSI);
		clrBit(SPI_DDR, SPI_SCK);
		setBit(SPI_DDR, SPI_MISO);
	}
	if(spiConfiguration.doubleSpeed)
		setBit(SPSR, SPI2X);
	else
		clrBit(SPSR, SPI2X);
	SPCR =	(spiConfiguration.interruptEnabled << SPIE) | 
			(spiConfiguration.enabled << SPE) | 
			(spiConfiguration.msbLsb << DORD) | 
			(spiConfiguration.ma	sterSlave << MSTR) | 
			(spiConfiguration.sckIdleValue << CPOL) | 
			(spiConfiguration.leadingTrailingEdge << CPHA) | 
			(spiConfiguration.clockPrescaler & 0x03);

*/
	return;
}

/* -----------------------------------------------------------------------------
 * Transmit data at the SPI bus in master mode
 * -------------------------------------------------------------------------- */

uint8 spiMasterTransmit(uint8 data)
{
	SPDR = data;
	waitUntilBitIsClear(SPSR, SPIF);
	return SPDR;
}

/* -----------------------------------------------------------------------------
 * Receives data from the SPI bus
 * -------------------------------------------------------------------------- */

uint8 spiSlaveTransmit(void)
{
	waitUntilBitIsClear(SPSR, SPIF);
	return SPDR;
}